applications/solvers/compressible/rhoPimpleAldFoam/examples/aldFoam/0/U
// This file is part of aldFoam
// Copyright 2019 Argonne UChicago LLC

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0)

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    substrate
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
