applications/solvers/compressible/rhoPimpleAldFoam/examples/aldFoam/system/blockMeshDict
// This file is part of aldFoam
// Copyright 2019 Argonne UChicago LLC

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.02;

vertices
(

    (0 0 0)
    (20 0 0)
    (20 1 0)
    (0 1 0)
    (0 0 0.1)
    (20 0 0.1)
    (20 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (400 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }

    inlet
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }

    substrate
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }

    Wall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
);


mergePatchPairs
(
);
